#+title: Hylinx Mod
#+FILETAGS: :work:
* TODO "Hylinx Mod" [0%]
:PROPERTIES:
:ORDERED:  t
:END:
** what is my goal or intention?
to create a set of factions, planets, and missions for a plant civilization in Endless Sky that is worthy of being included in the main game!
** why am I doing this?
for fun! Also I think it would be really novel, and would add a lot to ES. And I love ES! and also for validation
** TODO plan "Hylinx Mod" [4/5]
:PROPERTIES:
:ORDERED:  t
:END:
*** DONE capture your thoughts on "Hylinx Mod" :think:@computer:
:PROPERTIES:
:EFFORT:   8min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:11]
CLOCK: [2025-06-22 Sun 15:05]--[2025-06-22 Sun 15:11] =>  0:06
:END:
<2025-06-22 Sun 15:30-15:36>
**** questions to ask during an initial project brainstorm
***** what is my goal or intention?
***** what do I already know about this project?
***** what don't I know that I need to find out?
***** what can I read or listen to for relevant ideas?
***** who can I talk to who might provide insights?
*** DONE search for notes related to "Hylinx Mod" and dump them into the "basket" :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:14]
CLOCK: [2025-06-22 Sun 15:11]--[2025-06-22 Sun 15:14] =>  0:03
:END:
<2025-06-22 Sun 15:36-15:40>
**** make sure to scour the project archives as well
*** DONE consolidate the basket of "Hylinx Mod" into a component outline :think:@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:22]
CLOCK: [2025-06-22 Sun 15:14]--[2025-06-22 Sun 15:22] =>  0:08
:END:
<2025-06-22 Sun 15:40-15:44>

*** DONE break down the components of "Hylinx Mod" into smaller ones :think:@computer:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:29]
CLOCK: [2025-06-22 Sun 15:22]--[2025-06-22 Sun 15:29] =>  0:07
:END:
<2025-06-22 Sun 15:44-15:52>

*** TODO sketch out tasks of "Hylinx Mod" :flow:@computer:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
CLOCK: [2025-06-22 Sun 15:35]--[2025-06-22 Sun 15:41] =>  0:06
CLOCK: [2025-06-22 Sun 15:29]--[2025-06-22 Sun 15:30] =>  0:01
:END:
<2025-06-22 Sun 15:52-16:00>

** TODO components [0/6]
:PROPERTIES:
:ORDERED:  t
:END:
*** TODO research [0/4] :@computer:@internet:
**** TODO research what experts think on Intelligent Plants [0/1]
***** TODO look online for and take notes on what experts think on Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO research what the existing depictions of Intelligent Plants are [0/1]
***** TODO look online for and take notes on what the existing depictions of Intelligent Plants are
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO research what conditions would lead to Intelligent Plants [0/1]
***** TODO look online for and take notes on what conditions would lead to Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO research existing examples of Plant Intelligence [0/1]
***** TODO look online for and take notes on existing examples of Plant Intelligence
:PROPERTIES:
:EFFORT:   10min
:END:
*** TODO discussion [0/2]
**** TODO discuss this project's concept in the ES discord [0/1]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO ask some questions about the Hylinx concept on the ES Discord - ask some questions listed under this entry
- questions to ask
  - is the territory anticlockwise of the Remnant up for grabs for aspiring ES contributors?
  - can this ever fit in ES? if it doesn't fit in ES, will it still be good?
***** WAIT wait for 3 pieces of feedback
**** TODO discuss this project's concept in the ES Github [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO ask some questions about the Hylinx concept on the ES Github - ask some questions listed under this entry
- questions to ask
  - is the territory anticlockwise of the Remnant up for grabs for aspiring ES contributors?
  - can this ever fit in ES? if it doesn't fit in ES, will it still be good?
***** WAIT wait for 3 pieces of feedback
*** TODO first contact mission [0/3]
:PROPERTIES:
:ORDERED:  t
:END:
**** TODO ideas [0/1]
***** TODO brainstorm missions to add to the first contact mission :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
**** TODO goals [0/1]
***** TODO describe my goals for the First Conact Mission :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO conversations [0/1]
***** TODO write conversation entries for each of the missions :@computer:think:
:PROPERTIES:
:EFFORT:   30min
:END:
*** TODO jobs [0/2]
:PROPERTIES:
:ORDERED:  t
:END:
**** TODO describe jobs to be done in Hylinx Space :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO remix the existing job definitions into ones that work in Hylinx Space :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
*** TODO ship and outfit "personality" [0/2]
the ES crew have stated that they want all outfits in ES to have pros and cons, instead of one set being Superior in all aspects
**** TODO brainstorm what set of "pros and cons" Hylinx outfits - both generally and faction-specific - might have :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
**** TODO select 3 pros and cons of Hylinx Outfits :@computer:think:convg:
:PROPERTIES:
:EFFORT:   10min
:END:
*** TODO outfits [0/2]
**** TODO cooling [0/3]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 10 cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO write definitions for the cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO energy [/]
***** TODO brainstorm 15 energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 5 energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO write definitions for the energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** weapons [/]
***** beam weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** missile weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** projectile weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
*** ships [/]
**** transport [/]
***** brainstorm
**** light freighter [/]
**** heavy freighter [/]
**** light warship [/]
**** medium warship [/]
**** heavy warship [/]
**** interceptor [/]
**** utility [/]
**** drone [/]
**** carrier [/]
*** factions [/]
**** Klava [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** HyFed [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** HyCorps [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** Verohata [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
*** central aspect [/]
*** factions [/]
**** Klava [/]
**** Verohati [/]
**** HyFed [/]
**** HyCorps [/]
*** species [/]
**** Violetstalk
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
**** Sporadic
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
**** Eyed Vines
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
** TODO finish "Hylinx Mod" [0/1]
:PROPERTIES:
:ORDERED:  t
:END:
*** TODO review my project for packets of work that I could reuse :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
*** TODO review my project to see what went right and what went wrong :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
